<?php

// 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».

$regions = [
    'Московская область' => [
        'Москва',
        'Зеленоград',
        'Клин',
        'Коломна'
    ],
    'Ленинградская область' => [
        'Санкт-Петербург',
        'Всеволожск',
        'Кронштадт',
        'Павловск'
    ],
    'Рязанская область' => [
        'Рязань',
        'Скопин',
        'Касимов',
        'Кораблино'
    ]
];

foreach($regions as $towns => $town) {
    echo $towns . ':' . PHP_EOL;
        foreach($town as $name) {
            if(mb_substr($name, 0, 1) == 'К')
                echo $name . ' ';
        }
    echo PHP_EOL;
}