<?php

/* 9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит 
транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов 
на основе названия статьи в блогах). */

function translit($word)
{
    $arr = [
        'а' => 'a',
        'б' => 'b',
        'в' => 'v',
        'г' => 'g',
        'д' => 'd',
        'е' => 'e',
        'ё' => 'e',
        'ж' => 'j',
        'з' => 'z',
        'и' => 'i',
        'й' => 'i',
        'к' => 'k',
        'л' => 'l',
        'м' => 'm',
        'н' => 'n',
        'о' => 'o',
        'п' => 'p',
        'р' => 'r',
        'с' => 's',
        'т' => 't',
        'у' => 'u',
        'ф' => 'f',
        'х' => 'h',
        'ц' => 'c',
        'ч' => 'ch',
        'ш' => 'sh',
        'щ' => 'sc',
        'ъ' => '`',
        'ы' => 'y',
        'ь' => '`',
        'э' => 'e',
        'ю' => 'iu',
        'я' => 'ia',
        'А' => 'A',
        'Б' => 'B',
        'В' => 'V',
        'Г' => 'G',
        'Д' => 'D',
        'Е' => 'E',
        'Ё' => 'E',
        'Ж' => 'J',
        'З' => 'Z',
        'И' => 'I',
        'Й' => 'I',
        'К' => 'K',
        'Л' => 'L',
        'М' => 'M',
        'Н' => 'N',
        'О' => 'O',
        'П' => 'P',
        'Р' => 'R',
        'С' => 'S',
        'Т' => 'T',
        'У' => 'U',
        'Ф' => 'F',
        'Х' => 'H',
        'Ц' => 'C',
        'Ч' => 'CH',
        'Ш' => 'SH',
        'Щ' => 'SC',
        'Ъ' => '`',
        'Ы' => 'Y',
        'Ь' => '`',
        'Э' => 'E',
        'Ю' => 'IU',
        'Я' => 'IA'
    ];

    $word = strtr($word, $arr);
    return str_replace(' ', '_', $word);
}

echo translit('Москва, Лондон, Париж');
